{
  "education": [
    {
      "awards_achievements": [
        "Dean's List (2020, 2021)",
        "GPA: 3.7/4.0"
      ],
      "degree": "Bachelor of Science",
      "department": "Computer Science",
      "duration": "2018-2021",
      "school_name": "Western University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_BraikhnaYousafzai",
  "highlighted_projects": [
    {
      "description": "Programmed a C++ utility to track worldwide COVID-19 trends. COVID-19 data was pulled from an API as CSV file and converted to a JSON file using the `jq` command as a JSON processor. Designed the application using Visual Studio Code and recruited C++ STL packages for algorithm and iterator support.   The application sorts the data and plots terminal-based bar graphs of the data. Users utilize CLI input to request graphs related to specific trends such as countries with the highest total case and countries with the highest total death counts.",
      "git_url": "https://github.com/bmaqs/CS3307-Assignments/tree/master/A1",
      "name": "COVID-19 Graphing Program"
    },
    {
      "description": "Developed a C++ based software allowing businesses to track incidences of COVID-19 in their establishments and automate email notifications to a customer base. Designed the application using a factory builder design pattern. An online SQL database was provisioned to host the data, and executed SQL queries to select for customer groups affected by potential exposures. Leveraged the MySQL Connector for C++ library to gain access to drivers and connectors for database access. Email notifications were sent through pipe implementation. Finally, the GUI was created using the Qt toolkit. Separate interfaces were implemented to isolate role-based privileges between customers, businesses, and admin. This project was a collaborative submission for an Object-Oriented programming course submission. The project lifecycle was managed using agile and scrum frameworks.",
      "git_url": "https://github.com/bmaqs/CS3307-Assignments/tree/master/Group-45-Project",
      "name": "COVID 19 Contact Tracing System"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Implemented a Linux cluster monitoring agent using Shell scripts inserting hardware usage data for each cluster node into a PostgreSQL database. PostgreSQL was provisioned using Docker. Data was collected in real-time using a `crontab` job. Executed SQL queries to perform data analytics for cluster resource management purposes such as determining average CPU and memory consumption and detecting node failures. Git and Github were used for version control.",
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_BraikhnaYousafzai/tree/master/linux_sql",
      "name": "Cluster Monitor"
    }
  ],
  "name": "Braikhna Yousafzai",
  "others": [
    {
      "bullets": [
        "Art, painting: host fundraising paint nights at our local mosque.",
        "Volunteer, Pakistani Community Association of London: VP Culture"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Collaborated with developers, data engineers, and product managers in an agile environment. Created projects using technologies and toolkits such as Java, SQL, Docker, Linux, Bash, PostgreSQL, and Maven. Applied Gitflow as an organizational practice to project development. Participated in scrum ceremonies, including daily scrums, sprint retrospectives, and code reviews. Also took on responsibilities as a scrum master, heading the sprint retrospectives and providing resource planning to my team.",
      "duration": "2020-present",
      "title": "Software Developer"
    },
    {
      "company": "First Canadian Title",
      "description": "Constructed a reporting suite using SQL to visualize vendor performance and client KPI's. Operated as a vendor advisor and client solution consultant finding innovative strategies to achieve performance and financial goals. Assisted the project team in the UI design and deployment of a new vendor software. Devised user stories, worked with the QA team to create and execute test cases, as well as compiled a user manual for end-users.",
      "duration": "2017-2019",
      "title": "Data Analyst"
    }
  ],
  "skills": {
    "competent": [
      "Python",
      "R",
      "Docker",
      "PHP",
      "HTML",
      "CSS"
    ],
    "familiar": [
      "Hadoop",
      "NoSQL",
      "Tableau",
      "Crystal Reports",
      "Scala"
    ],
    "proficient": [
      "Java",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Linux/Bash",
      "Git",
      "C/C++"
    ]
  },
  "summary": "I am a recent graduate from Western University with a Bachelor's degree with a Specialization in Computer Science. Through my courses, I have built several projects using various programming languages, libraries, and development frameworks. These include Java, Python, Pandas, MySQL, and MongoDB. My interest in the software industry lies in its opportunities for growth and learning. I look forward to working collaboratively and across disciplines to apply my technical knowledge in creative and innovative ways. My technical interests are across engineering, data management, and data science. Outside of my career goals, I enjoy art, painting, and a good book. I am also quite involved with my community in different volunteering, leadership, and advocacy capacities."
}
