{
  "education": [
    {
      "awards_achievements": [
        "Dean's List (2020, 2021)",
        "GPA: 3.7/4.0"
      ],
      "degree": "Bachelor of Science",
      "department": "Computer Science",
      "duration": "2018-2021",
      "school_name": "Western University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_BraikhnaYousafzai",
  "highlighted_projects": [
    {
      "description": "Programmed a COVID-19 data tracker using C++ to allow for visual representations of worldwide COVID-19 trends. The project pulls COVID-19 data from API and the `iterator` object and `sort` function are used to parse and sort the data. The data is then graphed according to user input. This app issues graphical representation of trends such as countries with highest total case counts and countries with highest total death counts.",
      "git_url": "https://github.com/bmaqs/CS3307-Assignments/tree/master/A1",
      "name": "COVID-19 Graphing Program"
    },
    {
      "description": "Programmed a software allowing businesses to track incidences of COVID-19 in their establishments and automate exposure notifications to their customer base. Implemented customer, business, and app admin interfaces to separate role-based privileges. Businesses were able to send out exposure notifications to customer groups, while customers were able to receive notifications and report COVID-19 cases. The data was persisted on an online database server and SQL queries were used to select customer groups affected by potential exposures. To notify customers of exposures emails were sent out via a pipe. A GUI was designed using the Qt toolkit. This project was a collaborative submission for an Object Oriented Programming course submission. The project lifecycle was managed using agile and scrum frameworks.",
      "git_url": "https://github.com/bmaqs/CS3307-Assignments/tree/master/Group-45-Project",
      "name": "COVID 19 Contact Tracing System"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Implemented a Linux cluster monitoring agent using Shell scripts inserting hardware usage data for each cluster node into a PostgreSQL database. The data was collected in real-time using a `crontab` job and persisted using PostgreSQL. SQL queries were run to perform analytics on the cluster such as creating groups of nodes and determining average memory consumption. The project was deployed using a docker container, and version control was maintained through GitHub.",
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_BraikhnaYousafzai/tree/master/linux_sql",
      "name": "Cluster Monitor"
    }
  ],
  "name": "Braikhna Yousafzai",
  "others": [
    {
      "bullets": [
        "Art, painting",
        "Snowboarding",
        "Volunteer, Pakistani Community Association of London: VP Culture"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Worked on development and engineering projects in an agile enviornment. Worked on a scrum team, including taking on duties as a scrum master.",
      "duration": "2020-present",
      "title": "Software Developer"
    },
    {
      "company": "First Canadian Title",
      "description": "Collaborated with the project team in the design, implementation, and deployment of a new vendor software. Administrated and managed the vendor database. Built a reporting suite using SQL to visualize vendor performance and client KPI's. Worked as a vendor advisor and client solution consultant finding innovative strategies to achieve performance and financial goals.",
      "duration": "2017-2019",
      "title": "Data Analyst"
    }
  ],
  "skills": {
    "competent": [
      "Python",
      "R",
      "Docker",
      "PHP",
      "HTML",
      "CSS"
    ],
    "familiar": [
      "Hadoop",
      "NoSQL",
      "Tableau",
      "Crystal Reports",
      "Scala"
    ],
    "proficient": [
      "Java",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Linux/Bash",
      "Git",
      "C/C++"
    ]
  },
  "summary": "I enjoy the growth and constant learning that comes with the software industry. I am looking to apply and grow my development and engineering skills in creative ways. I enjoy working collaboratively and across disciplines to understand my projects and company comprehensively. I appreciate team-based approaches towards a cohesive solution. I am a recent graduate from Western University with a Bachelor's degree with Specialization in Computer Science. I have worked on several Java, Python, and database management projects throughout my degree. I most enjoy the engineering, data management, and analytic aspects of the industry. I enjoy painting, coffee, and a good book outside of work. I am also quite involved with my community in volunteering and leadership capacities."
}
